# https://www.acmicpc.net/problem/17427
# 시간초과
n = int(input())

g = 0
for i in range(n):
    i += 1
    f = 0
    for j in range(i):
        j += 1 
        if i % j == 0:
            f += j
    g += f
print(g)

'''
n = 10
10보다 작거나 같은 모든 자연수 y의 f(y)값을 더한 값은 g(10)로 표현한다
1: 1            => f(1) = 1
2: 1, 2         => f(2) = 3
3: 1, 3         => f(3) = 4  
4: 1, 2, 4      => f(4) = 7
5: 1, 5         => f(5) = 6
6: 1, 2, 3, 6   => f(6) = 12
7: 1, 7         => f(7) = 8
8: 1, 2, 4, 8   => f(8) = 15
9: 1, 3, 9      => f(9) = 13
10: 1, 2, 5, 10 => f(10) = 18





'''